import { createStore } from 'vuex'

export default createStore({
  state: {
    questions: [
      ['对付僵尸时候想带的物品', '想带到无人岛上的物品'],
      ['生物的受欢迎程度', '生物的凶残程度'],
      ['自己希望伴侣从事的职业', '受欢迎的条件、特技'],
      ['动漫角色的受欢迎程度', '游戏角色的受欢迎程度'],
      ['想要变成的生物', '生物的大小'],
      ['电器、电子产品的使用频率', '手机App的使用频率'],
      ['品牌的奢侈度', '品牌的知名度'],
      ['出差时携带物品的重要程度', '旅行时想携带物品的受欢迎程度'],
      ['宠物的受欢迎程度', '养某种宠物的开销'],
      ['女生想收到的生日礼物', '男生想收到的生日礼物'],
    ],
    subQuestion: [
      ['完全不想-非常想', '完全不想-非常想'],
      ['毫无人气-大受欢迎', '温顺-凶残'],
      ['完全不想-非常想', '毫无人气-大受欢迎'],
      ['毫无人气-大受欢迎', '毫无人气-大受欢迎'],
      ['完全不想-非常想', '很小-很大'],
      ['几乎不-经常', '几乎不-经常'],
      ['平民装-高大上', '闻所未闻-家喻户晓'],
      ['必备-不想带', '毫无人气-大受欢迎'],
      ['毫无人气-大受欢迎', '天价-散养'],
      ['完全不想-非常想', '完全不想-非常想'],
    ],
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  },
})
